app/views/chirps/_chirp.html.erb

<li>Author: <%= chirp.author.username %></li>
<li>Number of Likes: <%= chirp.likes.count %></li>
---
SELECT "likes".* FROM "likes" WHERE "likes"."chirp_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11)  [["chirp_id", 12], ["chirp_id", 13], ["chirp_id", 14], ["chirp_id", 15], ["chirp_id", 16], ["chirp_id", 17], ["chirp_id", 18], ["chirp_id", 19], ["chirp_id", 20], ["chirp_id", 21], ["chirp_id", 22]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."chirp_id" = $1  [["chirp_id", 12]]