app/controllers/application_controller.rb

  def current_user
    return nil if session[:session_token].nil?
    # looks up which user has the session_token that is stored in the browser's cookies
    @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "Ryo3t4QQQBcHKBu4sMOqqQ"], ["LIMIT", 1]]