app/controllers/chirps_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."chirp_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11)  [["chirp_id", 12], ["chirp_id", 13], ["chirp_id", 14], ["chirp_id", 15], ["chirp_id", 16], ["chirp_id", 17], ["chirp_id", 18], ["chirp_id", 19], ["chirp_id", 20], ["chirp_id", 21], ["chirp_id", 22]]
SELECT "chirps".* FROM "chirps"
---
  def index
    @chirps = Chirp.all.includes(:author, :likes)

SELECT  "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def show
    # debugger
    @chirp = Chirp.find(params[:id])

INSERT INTO "chirps" ("body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "I should not click on random buttons"], ["author_id", 16], ["created_at", "2021-06-22 17:21:30.265972"], ["updated_at", "2021-06-22 17:21:30.265972"]]
---
  def create
    # debugger
    @chirp = Chirp.new(chirp_params)
    if @chirp.save

SELECT  "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @chirp = Chirp.find(params[:id])

SELECT  "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "chirps" SET "body" = $1, "updated_at" = $2 WHERE "chirps"."id" = $3  [["body", "slap chirp"], ["updated_at", "2021-06-18 18:44:05.465994"], ["id", 1]]
---
  def update
    @chirp = Chirp.find(params[:id])
    if @chirp.update(chirp_params)

SELECT  "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "chirps" WHERE "chirps"."id" = $1  [["id", 2]]
---
  def destroy
    @chirp = Chirp.find(params[:id])
    @chirp.destroy