app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "age", "political_affiliation", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save