app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-06-21 18:34:14.897136"], ["session_token", "Ryo3t4QQQBcHKBu4sMOqqQ"], ["id", 29]]